Revit 2026 API

# DWFImportOptions(IListElementId) Constructor

---

Initializes a new instance of the DWFImportOptions class

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DWFImportOptions(
	IList<ElementId> views
)
```
```vb
Public Sub New (
	views As IList(Of ElementId)
)
```
```cpp
public:
DWFImportOptions(
	IList<ElementId^>^ views
)
```
```fsharp
new :
        views : IList<ElementId> -> DWFImportOptions
```

#### Parameters

views IListElementId

#### Reference

DWFImportOptions Class

DWFImportOptions Overload

Autodesk.Revit.DB Namespace